app/controllers/api/v1/fruits_controller.rb

    def index
        render json: Fruit.all
---
SELECT "fruits".* FROM "fruits"

    def create
        fruit = Fruit.create(fruit_params)
---
INSERT INTO "fruits" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "PeachFuzz"], ["description", "fuzzy"], ["created_at", "2018-08-06 16:42:22.056334"], ["updated_at", "2018-08-06 16:42:22.056334"]]

    def destroy
        Fruit.destroy(params[:id])
---
DELETE FROM "fruits" WHERE "fruits"."id" = ?  [["id", 9]]

    def update
        fruit = Fruit.find(params{:id})
---
SELECT  "fruits".* FROM "fruits" WHERE "fruits"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]